import 'package:education_system/Binding/Binding.dart';
import 'package:education_system/Core/Services/services.dart';
import 'package:education_system/routes.dart';
import 'package:flutter/material.dart';
import 'package:get/get.dart';

//ملخص لتطبيق نظام التعليم:
//
// تطبيق نظام التعليم هو تطبيق متكامل على الهواتف المحمولة مصمم لتسهيل جوانب مختلفة من عملية التعليم، بما في ذلك إدارة الطلاب، وإدارة الدورات، والتواصل بين الأطراف المعنية، والوصول إلى الموارد التعليمية. يهدف التطبيق إلى تبسيط العمليات داخل المؤسسات التعليمية وتعزيز تجربة التعلم للطلاب.
//
// الميزات:
//
// المصادقة على المستخدم:
//
// السماح للمستخدمين (الطلاب، المعلمين، المسؤولين) بتسجيل الدخول بأمان إلى حساباتهم باستخدام البريد الإلكتروني/كلمة المرور أو المصادقة عبر وسائل التواصل الاجتماعي.
// إدارة الطلاب:
//
// تمكين المسؤولين من إدارة سجلات الطلاب، بما في ذلك التسجيل، والمعلومات الشخصية، وسجلات الحضور، وتتبع الأداء الأكاديمي.
// السماح للطلاب بعرض ملفاتهم الشخصية، والتحقق من سجلات الحضور، والوصول إلى درجاتهم والسجل الأكاديمي.
// إدارة الدورات:
//
// توفير منصة للمعلمين والمسؤولين لإنشاء، وتحرير، وإدارة الدورات.
// السماح للمعلمين بتحميل مواد الدورة مثل المناهج الدراسية، وملاحظات المحاضرات، والواجبات، والاختبارات.
// تقديم الواجبات والتقييم:
//
// السماح للطلاب بتقديم الواجبات إلكترونياً من خلال التطبيق.
// تمكين المعلمين من تقدير الواجبات، وتقديم التغذية الراجعة، ومشاركة الدرجات مع الطلاب.
// أدوات الاتصال:
//
// تيسير التواصل بين الطلاب والمعلمين وأولياء الأمور من خلال ميزات الرسائل.
// السماح للمعلمين بإرسال إعلانات وتذكيرات وتحديثات للطلاب وأولياء الأمور.
// توفير منتدى أو لوحة نقاش حيث يمكن للطلاب طرح الأسئلة والتعاون مع الأقران.
// التقويم والجدولة:
//
// دمج ميزة التقويم لعرض التواريخ الهامة مثل الامتحانات وتاريخ استحقاق الواجبات وفعاليات المدرسة.
// السماح للمستخدمين بتعيين تذكيرات للأحداث القادمة والمواعيد النهائية.
// مكتبة الموارد:
//
// توفير الوصول إلى الموارد التعليمية مثل الكتب الإلكترونية، والمقالات، ومقاطع الفيديو، والمواد التعليمية التفاعلية.
// تصنيف الموارد استنادًا إلى المواد، والمواضيع، والمستويات التعليمية لتسهيل التصفح.
// تحليل الأداء:
//
// توفير لوحات المعلومات والتقارير للمسؤولين والمعلمين والطلاب لتتبع الأداء الأكاديمي، والحضور، والمشاركة.
// إنشاء تقارير وتحليلات لتحديد المجالات التي يمكن تحسينها ومراقبة تقدم الطلاب مع مرور الوقت.
// إشعارات الدفع:
//
// إرسال إشعارات فورية للمستخدمين للتحديثات الهامة، والمواعيد النهائية، والإعلانات.
// السماح للمستخدمين بتخصيص تفضيلات الإشعار استنادًا إلى تفضيلاتهم واهتماماتهم.
// الوصولية والتعريب:
//
// التأكد من قدرة التطبيق على الوصول لذوي الاحتياجات الخاصة من خلال تنفيذ ميزات الوصولية مثل قارئي الشاشة وأوامر الصوت.
// دعم التعريب لاستيعاب المستخدمين من مناطق مختلفة من خلال توفير الدعم متعدد اللغات وتكييف المحتوى استنادًا إلى تفضيلات المستخدم
void main() async{
  WidgetsFlutterBinding.ensureInitialized();
  await initialServies();
  runApp(const MyApp());
}
class MyApp extends StatelessWidget {
  const MyApp({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return GetMaterialApp(
      debugShowCheckedModeBanner: false,
      title: 'Flutter Demo',
      //theme:themeData,
      //home: onBoarding(),
      initialBinding:IntialBinding() ,
      getPages: routes,
      // routes: routes
    );
  }
}
//Get.toNamed
//
// You can navigate from one page to another, and you can also go back by clicking the back button.
//
// Get.offNamed
//
// You can navigate from one page to another, but when you click on the back icon, it will back you 2 steps.
//
// Get.offAllNamed
//
// You can navigate from one page to another, but when you click on the back icon, you can't go back.